{
  "education": [
    {
      "awards_achievements": [
        "President's Gold Scholarship",
        "Dean's List (2022)"
      ],
      "degree": "Honours Bachelor of Arts",
      "department": "Finance and Economics",
      "duration": "2018-2022",
      "school_name": "Wilfrid Laurier University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-riavisweswaran",
  "highlighted_projects": [
    {
      "description": "Spearheaded an initiative to raise over $5000 for the Down Syndrome Association of Toronto and the Arthritis Society of Canada. Wrote and directed a stage production and networked with key contacts at respective charities to coordinate a series of events. Led an online marketing campaign and collaborated with teams to present the finished product, employing effective problem-solving techniques when issues arose.",
      "name": "Charity Fundraiser"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed a database schema in PostgreSQL to retrieve hardware statistics and minute-by-minute host usage data based on requirements for the linux clustering agent team. Utilized Linux command lines, bash scripts, Docker and crontab to retrieve data. Documented scope, database modelling, diagrams and code, and stored in local and remote repositories using Git/GitHub.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Ria Visweswaran",
  "others": [
    {
      "bullets": [
        "CGI Award of Excellence (2021)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Poetry - Young Voices Magazine (2019)"
      ],
      "title": "Publications"
    },
    {
      "bullets": [
        "Karate; black belt",
        "Writing; 100,000 word manuscript over 4 months",
        "Volunteer, Down Syndrome Association of Toronto \u0026 Beer Store Leukemia Bottle Drive"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Works within an Agile/Scrum framework to collaborate with cross-functional teams and design RDBMS systems to meet business goals. Makes recommendations for solutions or improvements that can be accomplished through new technology or alternative uses of existing technology. Possesses in-depth knowledge of Linux, SQL, PostgreSQL, Docker and VM as well as Git version control tools.",
      "duration": "2023-present",
      "title": "Technical Consultant"
    },
    {
      "company": "Imzado Trading",
      "description": "Analyzed macro trends of stock behaviours including scatter of variation, stock convergences and risk arbitrage to to prevent losses on investments. Leveraged R to build statistical simulations, Trello to manage workflows and Excel's VLOOKUP, statistical formulas, nested If statements, pivot tables and charts to find optimal success ratios.",
      "duration": "2023",
      "title": "Research Analyst"
    },
    {
      "company": "CGI",
      "description": "Collaborated with SMEs in the MRD sector to conduct requirements elicitation and ensure cohesion with design and implementation of SAP projects. Worked across 13 client accounts and developed monthly Power BI reports to identify trends, patterns, and anomalies of monthly KPIs. Received an award of excellence for designing a high-level forecasting solution to meet system needs of a key client, resulting in a $200,000 statement of work.",
      "duration": "2020-2021",
      "title": "Project Control Officer"
    },
    {
      "company": "Good News Ventures",
      "description": "Worked closely with stakeholders through daily stand-ups and ensured that financial data, equity derivatives and market trends were documented to support strategic decision-making. Leveraged HubSpot's Python API to streamline data entry processes and update records for 200+ prospective investments, generating contact lists based on specific queries. Conducted meetings with CEOs of SaaS, AI and Quantum start-ups to analyze business operations and discuss potential partnerships.",
      "duration": "2019",
      "title": "Investment Analyst"
    }
  ],
  "skills": {
    "Business Skills": [
      "Agile/Scrum and Waterfall",
      "Cross-functional Communication",
      "Requirements Elicitation",
      "CRM (Salesforce, Hubspot)"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Modeling/Mapping",
      "Data Analytics (R, Stata)",
      "Python",
      "Power BI",
      "Excel (macros, pivot tables, VLOOKUP, formulas)"
    ]
  },
  "summary": "I am a recent Finance and Economics graduate from Wilfrid Laurier University with 1.5 years of cross-functional work experience and knowledge of RDBMS. Through my research initiatives, I have developed a keen interest in analyzing business systems and identifying opportunities to improve processes. My background in consulting has enabled me to liaise between clients, SMEs and implementation teams to coordinate SLAs. Additionally, I am proud to be the founder of several charity initiatives that have raised funds for the Down Syndrome Association of Toronto and the Arthritis Society of Canada. I am excited to bring my dynamic leadership skills, collaborative mindset, and technical experience to a full-time business systems analyst role."
}
